[Survived] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:30:31
                     id="orgCode"
                     type="text"
                 {...register("orgCode", {
-                    required: "Organization code is required.",
+                    required: "",
                     maxLength : {
                         value: 5,

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:70:35
                     type="text"
                     isInvalid={Boolean(errors.description)}
                     {...register("orgTranslation", {
-                        required: "Organization translation is required."
+                        required: ""
                     })}
                 />
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Organization translation is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
