[Killed] BlockStatement
main/components/UCSBOrganization/UCSBOrganizationTable.js:16:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/UCSBOrganization/edit/${cell.row.values.orgCode}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: RestaurantTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/UCSBOrganization/edit/SKY"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:48:17
         },
         {
             Header: 'Inactive',
-            id: 'inactive',
+            id: "",
             accessor: (row, _rowIndex) => String(row.inactive) // hack needed for boolean values to show up
         }
killedBy: RestaurantTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-inactive"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Survived] ArrowFunction
main/components/UCSBOrganization/UCSBOrganizationTable.js:49:23
         {
             Header: 'Inactive',
             id: 'inactive',
-            accessor: (row, _rowIndex) => String(row.inactive) // hack needed for boolean values to show up
+            accessor: () => undefined // hack needed for boolean values to show up
         }
     ];
