[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:55:15
               }
             </Nav>
             {
-              currentUser && currentUser.loggedIn && (
-                <>
-                  <Nav.Link as={Link} to="/restaurants">Restaurants</Nav.Link>
-                  <Nav.Link as={Link} to="/UCSBOrganization">UCSB Organization</Nav.Link>
-                  <Nav.Link as={Link} to="/ucsbdates">UCSB Dates</Nav.Link>
-                  <Nav.Link as={Link} to="/placeholder">Placeholder</Nav.Link>
-                </>
-              )
+              false
             }
             <Nav className="ml-auto">
killedBy: AppNavbar tests renders the ucsbdates link correctly
statusReason: Error: Unable to find an element with the text: UCSB Dates. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:55:15
               }
             </Nav>
             {
-              currentUser && currentUser.loggedIn && (
-                <>
-                  <Nav.Link as={Link} to="/restaurants">Restaurants</Nav.Link>
-                  <Nav.Link as={Link} to="/UCSBOrganization">UCSB Organization</Nav.Link>
-                  <Nav.Link as={Link} to="/ucsbdates">UCSB Dates</Nav.Link>
-                  <Nav.Link as={Link} to="/placeholder">Placeholder</Nav.Link>
-                </>
-              )
+              true
             }
             <Nav className="ml-auto">
killedBy: AppNavbar tests renders the ucsbdates link correctly
statusReason: Error: Unable to find an element with the text: UCSB Dates. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >
