[Killed] BlockStatement
src/main/utils/UCSBOrganizationUtils.js:8:47
     toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/UCSBOrganization",
-        method: "DELETE",
-        params: {
-            orgCode: cell.row.values.orgCode
-        }
-    }
-}
+export function cellToAxiosParamsDelete(cell) {}
 
 
killedBy: UCSBOrganizationUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"method": "DELETE", "params": {"orgCode": "SKY"}, "url": "/api/UCSBOrganization"}
Received: undefined

[Killed] ObjectLiteral
src/main/utils/UCSBOrganizationUtils.js:9:12
 }
 
 export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/UCSBOrganization",
-        method: "DELETE",
-        params: {
-            orgCode: cell.row.values.orgCode
-        }
-    }
+    return {}
 }
 
killedBy: UCSBOrganizationUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Object {
-   "method": "DELETE",
-   "params": Object {

[Killed] StringLiteral
src/main/utils/UCSBOrganizationUtils.js:11:17
 export function cellToAxiosParamsDelete(cell) {
     return {
         url: "/api/UCSBOrganization",
-        method: "DELETE",
+        method: "",
         params: {
             orgCode: cell.row.values.orgCode
killedBy: UCSBOrganizationUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "method": "DELETE",
+   "method": "",
