[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:31:14
     return (
         <Form onSubmit={handleSubmit(submitAction)}>
 
-            {initialContents && (
-                <Form.Group className="mb-3" >
-                    <Form.Label htmlFor="id">ID</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-id"}
-                        id="id"
-                        type="text"
-                        {...register("id")}
-                        value={initialContents.id}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {true}
 
             <Form.Group className="mb-3" >
killedBy: MenuItemReviewForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:31:14
     return (
         <Form onSubmit={handleSubmit(submitAction)}>
 
-            {initialContents && (
-                <Form.Group className="mb-3" >
-                    <Form.Label htmlFor="id">ID</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-id"}
-                        id="id"
-                        type="text"
-                        {...register("id")}
-                        value={initialContents.id}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {false}
 
             <Form.Group className="mb-3" >
killedBy: MenuItemReviewForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:68:51
                     id="reviewerEmail"
                     type="text"
                     isInvalid={Boolean(errors.reviewerEmail)}
-                    {...register("reviewerEmail", {
-                        required: "Reviewer Email is required.",
-                        maxLength : {
-                            value: 30,
-                            message: "Max length 30 characters"
-                        }
-                    })}
+                    {...register("reviewerEmail", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Reviewer Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:68:34
                     id="reviewerEmail"
                     type="text"
                     isInvalid={Boolean(errors.reviewerEmail)}
-                    {...register("reviewerEmail", {
+                    {...register("", {
                         required: "Reviewer Email is required.",
                         maxLength : {
killedBy: MenuItemReviewForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:70:37
                     isInvalid={Boolean(errors.reviewerEmail)}
                     {...register("reviewerEmail", {
                         required: "Reviewer Email is required.",
-                        maxLength : {
-                            value: 30,
-                            message: "Max length 30 characters"
-                        }
+                        maxLength : {}
                     })}
                 />
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Max length 30 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:88:43
                     id="stars"
                     type="number"
                     isInvalid={Boolean(errors.stars)}
-                    {...register("stars", {
-                        required: "Star rating is required.",
-                        min: {
-                            value: 0,
-                            message: "Minimum value is 0"
-                        },
-                        max: {
-                            value: 5,
-                            message: "Maximum value is 5"
-                        }
-                    })}
+                    {...register("stars", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Star rating is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:129:46
                     id="comments"
                     type="text"
                     isInvalid={Boolean(errors.comments)}
-                    {...register("comments", {
-                        required: "Comment is required.",
-                        maxLength : {
-                            value: 500,
-                            message: "Max length 500 characters"
-                        }
-                    })}
+                    {...register("comments", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Comment is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:130:35
                     type="text"
                     isInvalid={Boolean(errors.comments)}
                     {...register("comments", {
-                        required: "Comment is required.",
+                        required: "",
                         maxLength : {
                             value: 500,
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Comment is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
