[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:16:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/recommendationrequests/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/recommendationrequests/edit/2"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:17:18
     const navigate = useNavigate();
 
     const editCallback = (cell) => {
-        navigate(`/recommendationrequests/edit/${cell.row.values.id}`)
+        navigate(``)
     }
 
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/recommendationrequests/edit/2"
Received: ""

Number of calls: 1

<html>

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:38:9
             accessor: 'id', // accessor is the "key" in the data
         },
 
-        {
-            Header: 'Requester Email',
-            accessor: 'requesterEmail',
-        },
+        {},
         {
             Header: 'Professor Email',
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!
