[Survived] BlockStatement
src/main/utils/recommendationRequestUtils.js:8:47
     toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/recommendationrequests",
-        method: "DELETE",
-        params: {
-            id: cell.row.values.id
-        }
-    }
-}
+export function cellToAxiosParamsDelete(cell) {}
 
 

[Survived] StringLiteral
src/main/utils/recommendationRequestUtils.js:10:14
 
 export function cellToAxiosParamsDelete(cell) {
     return {
-        url: "/api/recommendationrequests",
+        url: "",
         method: "DELETE",
         params: {
