[Killed] ArrowFunction
main/pages/RecommendationRequest/RecommendationRequestCreatePage.js:8:33
 import { toast } from "react-toastify";
 
 export default function RecommendationRequestCreatePage({storybook=false}) {
-    const objectToAxiosParams = (recommendationRequest) => ({
-        url: "/api/recommendationrequests/post",
-        method: "POST",
-        params: {
-         requesterEmail: recommendationRequest.requesterEmail,
-         professorEmail: recommendationRequest.professorEmail,
-         explanation: recommendationRequest.explanation,
-         dateRequested: recommendationRequest.dateRequested,
-         dateNeeded: recommendationRequest.dateNeeded,
-         done: recommendationRequest.done
-        }
-      });
+    const objectToAxiosParams = () => undefined;
     
       const onSuccess = (recommendationRequest) => {
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
