[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:34:21
 
     const columns = [
         {
-            Header: 'ID',
+            Header: "",
             accessor: 'id', // accessor is the "key" in the data
         },
killedBy: MenuItemReviewTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: ID. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:43:23
         },
         {
             Header: 'Reviewer Email',
-            accessor: 'reviewerEmail',
+            accessor: "",
         },
         {
killedBy: MenuItemReviewTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemReviewTable-cell-row-0-col-reviewerEmail"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
