[Killed] ArrowFunction
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:9:31
 
 export default function UCSBOrganizationCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (organization) => ({
-    url: "/api/UCSBOrganization/post",
-    method: "POST",
-    params: {
-     orgCode: organization.orgCode,
-     orgTranslationShort: organization.orgTranslationShort,
-     orgTranslation: organization.orgTranslation,
-     inactive: organization.inactive
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (organization) => {
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /UCSBOrganization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:12:13
   const objectToAxiosParams = (organization) => ({
     url: "/api/UCSBOrganization/post",
     method: "POST",
-    params: {
-     orgCode: organization.orgCode,
-     orgTranslationShort: organization.orgTranslationShort,
-     orgTranslation: organization.orgTranslation,
-     inactive: organization.inactive
-    }
+    params: {}
   });
 
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /UCSBOrganization
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Object {
-   "inactive": true,
-   "orgCode": "OSLI",

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:20:39
     }
   });
 
-  const onSuccess = (organization) => {
-    toast(`New organization Created - orgCode: ${organization.orgCode}`);
-  }
+  const onSuccess = (organization) => {}
 
   const mutation = useBackendMutation(
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /UCSBOrganization
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New organization Created - orgCode: OSLI"

Number of calls: 0

[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:21:11
   });
 
   const onSuccess = (organization) => {
-    toast(`New organization Created - orgCode: ${organization.orgCode}`);
+    toast(``);
   }
 
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /UCSBOrganization
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New organization Created - orgCode: OSLI"
Received: ""

Number of calls: 1
