[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:15:13
         useBackend(
             // Stryker disable next-line all : don't test internal caching of React Query
             [`/api/UCSBOrganization?orgCode=${orgCode}`],
-            {  // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
-                method: "GET",
-                url: `/api/UCSBOrganization`,
-                params: {
-                    orgCode
-                }
-            }
+            {}
         );
 
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:18:25
             {  // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
                 method: "GET",
                 url: `/api/UCSBOrganization`,
-                params: {
-                    orgCode
-                }
+                params: {}
             }
         );
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:24:36
             }
         );
 
-    const objectToAxiosPutParams = (organization) => ({
-        url: "/api/UCSBOrganization",
-        method: "PUT",
-        params: {
-            orgCode: organization.orgCode,
-        },
-        data: {
-            orgTranslationShort: organization.orgTranslationShort,
-            orgTranslation: organization.orgTranslation,
-            inactive: organization.inactive,
-        }
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (organization) => {
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Organization Updated - orgCode: SKY orgTranslationShort: SKYWATCHING CLUB"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:26:17
 
     const objectToAxiosPutParams = (organization) => ({
         url: "/api/UCSBOrganization",
-        method: "PUT",
+        method: "",
         params: {
             orgCode: organization.orgCode,
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Organization Updated - orgCode: SKY orgTranslationShort: SKYWATCHING CLUB"
Received: "Organization Updated - orgCode: SKY orgTranslationShort: SKYDIVING CLUB"

Number of calls: 1

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:30:15
         params: {
             orgCode: organization.orgCode,
         },
-        data: {
-            orgTranslationShort: organization.orgTranslationShort,
-            orgTranslation: organization.orgTranslation,
-            inactive: organization.inactive,
-        }
+        data: {}
     });
 
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"orgTranslationShort\":\"SKYWATCHING CLUB\",\"orgTranslation\":\"SKYWATCHING CLUB AT UCSB\",\"inactive\":true}"
Received: "{}"

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:37:41
         }
     });
 
-    const onSuccess = (organization) => {
-        toast(`Organization Updated - orgCode: ${organization.orgCode} orgTranslationShort: ${organization.orgTranslationShort}`);
-    }
+    const onSuccess = (organization) => {}
 
     const mutation = useBackendMutation(
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:38:15
     });
 
     const onSuccess = (organization) => {
-        toast(`Organization Updated - orgCode: ${organization.orgCode} orgTranslationShort: ${organization.orgTranslationShort}`);
+        toast(``);
     }
 
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Organization Updated - orgCode: SKY orgTranslationShort: SKYWATCHING CLUB"
Received: ""

Number of calls: 1

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:54:34
         mutation.mutate(data);
     }
 
-    if (isSuccess && !storybook) {
-        return <Navigate to="/UCSBOrganization" />
-    }
+    if (isSuccess && !storybook) {}
 
     return (
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/UCSBOrganization"}

Number of calls: 0

[Killed] ConditionalExpression
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:63:21
             <div className="pt-2">
                 <h1>Edit Organization</h1>
                 {
-                    organization && <UCSBOrganizationForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={organization} />
+                    false
                 }
             </div>
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:63:21
             <div className="pt-2">
                 <h1>Edit Organization</h1>
                 {
-                    organization && <UCSBOrganizationForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={organization} />
+                    organization || <UCSBOrganizationForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={organization} />
                 }
             </div>
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Objects are not valid as a React child (found: object with keys {orgCode, orgTranslationShort, orgTranslation, inactive}). If you meant to render a collection of children, use an array instead.
