[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationIndexPage.js:17:23
         useBackend(
             // Stryker disable next-line all : don't test internal caching of React Query
             ["/api/UCSBOrganization/all"],
-            { method: "GET", url: "/api/UCSBOrganization/all" },
+            { method: "", url: "/api/UCSBOrganization/all" },
             // Stryker disable next-line all : don't test default value of empty list
             []
killedBy: UCSBOrganizationIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/UCSBOrganization/all"
Received string:    "Error communicating with backend via  on /api/UCSBOrganization/all"

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationIndexPage.js:22:32
             []
         );
 
-    const createButton = () => {
-        if (hasRole(currentUser, "ROLE_ADMIN")) {
-            return (
-                <Button
-                    variant="primary"
-                    href="/UCSBOrganization/create"
-                    style={{ float: "right" }}
-                >
-                    Create Organization
-                </Button>
-            )
-        } 
-    }
+    const createButton = () => {}
 
     return (
killedBy: UCSBOrganizationIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Organization/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationIndexPage.js:23:49
         );
 
     const createButton = () => {
-        if (hasRole(currentUser, "ROLE_ADMIN")) {
-            return (
-                <Button
-                    variant="primary"
-                    href="/UCSBOrganization/create"
-                    style={{ float: "right" }}
-                >
-                    Create Organization
-                </Button>
-            )
-        } 
+        if (hasRole(currentUser, "ROLE_ADMIN")) {} 
     }
 
killedBy: UCSBOrganizationIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Organization/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
