[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:14:18
     const navigate = useNavigate();
 
     const editCallback = (cell) => {
-        navigate(`/helprequests/edit/${cell.row.values.id}`)
+        navigate(``)
     }
 
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/helprequests/edit/1"
Received: ""

Number of calls: 1

<html>

[Killed] ArrowFunction
main/components/HelpRequest/HelpRequestTable.js:58:19
         {
             Header: 'Solved',
             accessor: 'solved',
-            Cell: ({ value }) => value ? "Yes" : "No"
+            Cell: () => undefined
         }
     ];
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:58:42
         {
             Header: 'Solved',
             accessor: 'solved',
-            Cell: ({ value }) => value ? "Yes" : "No"
+            Cell: ({ value }) => value ? "" : "No"
         }
     ];
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Yes
Received:
